In [13]:
import pandas as pd
import numpy as np

In [8]:
df=pd.read_csv('weather2.csv',parse_dates=['date'])
df

        date      city  temperature  humidity
0 2017-05-01  new york           65        56
1 2017-05-01  new york           61        54
2 2017-05-02  new york           70        60
3 2017-05-02  new york           72        62
4 2017-05-01    mumbai           75        80
5 2017-05-01    mumbai           78        83
6 2017-05-02    mumbai           82        85
7 2017-05-02    mumbai           80        26

In [4]:
df.dtypes

date           object
city           object
temperature     int64
humidity        int64
dtype: object

In [9]:
type(df.date[0])

pandas._libs.tslibs.timestamps.Timestamp

In [20]:
df.pivot_table(index='city',columns='date',margins=True,aggfunc=np.mean)#it's calculate the overall element

                    humidity                                    temperature  \
date     2017-05-01 00:00:00 2017-05-02 00:00:00    All 2017-05-01 00:00:00
city
mumbai                 81.50               55.50  68.50               76.50
new york               55.00               61.00  58.00               63.00
All                    68.25               58.25  63.25               69.75


date     2017-05-02 00:00:00     All
city
mumbai                  81.0  78.750
new york                71.0  67.000
All                     76.0  72.875

In [17]:
df.pivot_table(index='city',columns='date',aggfunc={'temperature':np.mean})#only mean temperature

         temperature
date      2017-05-01 2017-05-02
city
mumbai          76.5       81.0
new york        63.0       71.0

In [18]:
df.pivot_table(index='temperature',columns='date')#not so much good

              humidity
date        2017-05-01 2017-05-02
temperature
61                54.0        NaN
65                56.0        NaN
70                 NaN       60.0
72                 NaN       62.0
75                80.0        NaN
78                83.0        NaN
80                 NaN       26.0
82                 NaN       85.0